// 통계 및 분석
// 시스템 사용 통계 및 분석 정보 확인
// 통계로 나온 분석패턴의 시각화


// 명세서 고칠때
// 무조건 명확하게
//* 회원가입시 ~~, ~~, ~~ 등 <- 에서 '등'이라는 표현이 들어가면 안됨.
// 무엇을 수정하고 무엇이 변경가능하고 무엇이 변경이 안되는지를 정확하게 명시

//* 추상적인 단어가 들어갔는지 다시 확인해보기 (최대한 빠르게)


//* sns 연동을 끊고 싶을때

// 관리자(ADMIN) 도 로그인?!

//! 같은 기능은 한개의 요구사항명시로 통일
// =====================================================
// 범위 - 사용자 -> 고객

// 관리자 - *관리자만이?* 전체 소통 플랫폼을 조회할 수있다 - > 비공개글을 다른 고객이 볼 수 없게 하기 위해
//  조회한다면 어느정도가 필요한지

// 고객 - 소통플랫폼  *등록* *쓰기* 중복 / *이동* 좀더 명확하게 /
//      - ** 

// 디자이너 - *로그인*(소셜) 등 빼기
//          - *디자이너정보*

// 제약사항 -- 등 관련 법규 준수한다.

// 불법적인 개인간의 거래시 

사진으로 보낼 때 처리속도 때문에
사업자 등록을 확인하는 API 를 적용할 수 있을지 확인해보기

업체의 등급 기분을 명확하게 정리

광고관리 수수료를 어떻게 받을지 웹 서비스로 받는다면 결제 시스템도 있어야함

// ======================================================================
//  헤어샵 API 끌어와서 예약이 되는지 확인해보기

모바일 알림의 경우 백그라운드에서 계속 돌아가기 때문에 가능한데
웹의 경우 꺼버리면 끝이라서 구현하기 어려움

비기능 - 트래픽이랑 상관이 없는 내용








