/*
    배열 : 
*/

/*
    배열 리터럴 : 
    - 
    - 
    - 
*/


console.log('==============================');

/*
    배열의 요소 추가
    - 
    - 
*/


console.log('==============================');

/*
    배열의 요소 삭제
    - 
*/


console.log('==============================');

/*
    배열의 순회
    - 
*/


console.log('==============================');

/*
    - 
    - 
*/


console.log('==============================');

/*
    배열의 길이 : 
*/


console.log('==============================');

/*
    배열 메서드
*/

/*
    indexOf(element) : 
    - 
    - 
*/


console.log('==============================');

/*
    includes(element) :
    - 
*/


console.log('==============================');

/*
    push(element) :
    - 
*/


console.log('==============================');

/*
    pop() :
    - 
*/


console.log('==============================');

/*
    shift() :
    - 
*/


console.log('==============================');

/*
    reverse() :
    - 
*/


console.log('==============================');

/*
    concat(array or item) : 
    - 
*/


console.log('==============================');

/*
    slice(start, end) : 
    - 
*/


console.log('==============================');

/*
    splice(start, eleteCount, items...) :
    - 
*/




